# 9. Customer Data Preparation
#### _Clean customer data and combine it with the rest of prepared Instacart data_
## Table of contents
***

**`1. Import libraries`**<br/>

**`2. Create path and import data`**<br/>

**`3. Data wrangling`**<br/>
    - Column format unification<br/>
    - Conver column data types<br/>
    - Drop unnecessary columns<br/>


**`4. Data consistency check`**<br/>
    - Identify mixed-type columns<br/>
    - Locate missing values (NULL)<br/>
    - Locate duplicates<br/>
    
**`5. Data preparation prior to the merge`**<br/>

**`6. Inner merge data`**<br/>

**`7. Export data`**

***

### 1. Import libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

### 2. Create path and import data

In [2]:
# Create path
path = r'/Users/bonnieandbanana/Desktop/A New Career/CareerFoundry/Data Immersion/A4_Python/ Instacart Basket Analysis Project (IC)'

# Import customers data
df_cus = pd.read_csv(os.path.join(path, '02 data' , 'original data' , 'customers.csv'), index_col = False)

In [3]:
# Check data info
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

**Obervation:**<br/>
*`Data wrangling`* <br/>
     - Column formats are not unified.<br/>
     - All variables provide essential information for the analysis, there's no need to drop any columns.<br/>
     - Column 'user_id' and 'age' are considered as categorical variables rather than numerical variables, they should be converted into 'string' values.<br/>
<br/>
*`Data consistency check`*<br/>
    - In column 'First Name', the non-null value count does not match with the rest of the columns. It is suspected that there're null values present in the column that should be investigated.<br/>

In [4]:
# Check data shape
df_cus.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 3. Data wrangling

#### _Column format unification_

In [5]:
# Rename columns
df_cus = df_cus.rename(columns = {'First Name':'first_name' , 'Surnam':'surname' , 'Gender':'gender' , 'STATE':'state' , 'Age':'age' , 'dependants':'n_dependants', 'fam_status':'marital_status'})

In [6]:
# Check output
df_cus.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

**Observation:** <br/>
The format of all columns are uniformized.

#### _Convert column data types_

In [7]:
# Convert data type for column user_id from numerical to string
df_cus['user_id'] = df_cus['user_id'].astype('str')

In [8]:
# Convert data type for column user_id from numerical to string
df_cus['age'] = df_cus['age'].astype('str')

In [9]:
# Check results
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(2), object(8)
memory usage: 15.7+ MB

**Obersvation:**
Data types of 'user_id' and 'age' are converted into 'Object' from 'inte64'. (string in Python)

#### *Drop unnecessary columns*<br/>
- All variables provide essential information for the analysis, there's no need to drop any columns.

In [16]:
# Downsize data
df_cus = df_cus.astype({col: 'int32' for col in df_cus.select_dtypes('int64').columns})

In [17]:
# Check results
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(2), object(8)
memory usage: 14.2+ MB

### 4. Data consistency check using for-loops

#### *Identify mixed-type columns*

In [18]:
for col in df_cus.columns.tolist():
    weird = (df_cus[[col]] . applymap(type) != df_cus [[col]] . iloc[0] . apply(type)) . any(axis = 1)
    if len (df_cus [weird]) > 0 :
             print (col)

first_name

**Observation:**<br/>
The column 'first_name' contains mixed-type values.

In [19]:
# Convert 'first_name' column data type to 'string'
df_cus['first_name'] = df_cus['first_name'].astype('str')

In [20]:
# Check results
for col in df_cus.columns.tolist():
    weird = (df_cus[[col]] . applymap(type) != df_cus [[col]] . iloc[0] . apply(type)) . any(axis = 1)
    if len (df_cus [weird]) > 0 :
             print (col)

**Observation:**
Mixed-type data in column 'first_name' is fixed.

#### *Locate missing values*

In [21]:
# Check if there's anynull values in the dataframe
df_cus.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

**Appropriate method evaluation**<br/>
After mixed-type values are fixed in colmun 'first_name', there's no more missing values in the dataframe.

In [22]:
# Cross check the results
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(2), object(8)
memory usage: 14.2+ MB

#### *Locate duplicates*

In [23]:
# Create a subset that only contains duplicates
df_dups = df_cus[df_cus.duplicated()]

In [24]:
# Check the subset
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

**Observation:**<br/>
There's no duplicates exist in the dataframe.

In [25]:
# Check value frequency in gender column
df_cus['gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: gender, dtype: int64

**Observation:**<br/>
This steps is to make sure whether there's more different types of gender in the column, such as, nonbinary, bisexual, transgender,etc.

### 5. Data preparation prior to the merge

In [26]:
# Import the other prepared Instacart data
ords_prods = pd.read_pickle (os.path.join(path, '02 data' , 'prepared data' , 'ords_prods_aggregated.pkl'))

In [27]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int64
 1   user_id                    int64
 2   order_number               int64
 3   order_day_of_the_week      int64
 4   order_hour_of_day          int64
 5   days_since_last_order      float64
 6   first_order                bool
 7   product_id                 int64
 8   add_to_cart_order          int64
 9   reordered                  int64
 10  _merge                     category
 11  product_name               object
 12  aisle_id                   int64
 13  department_id              int64
 14  prices                     float64
 15  match                      category
 16  price_range_loc            object
 17  busiest_day                object
 18  busiest days               object
 19  busiest_period_of_the_day  object
 20  max_order                  int64
 21  loyalty_flag               object
 22  avg_order_price            float64
 23  spending_flag              object
 24  median_of_regularity       float64
 25  order_frequency_flag       object
dtypes: bool(1), category(2), float64(4), int64(11), object(8)
memory usage: 5.9+ GB

In [30]:
# Downsize dataframe by converting data type 
ords_prods = ords_prods.astype({col: 'int32' for col in ords_prods.select_dtypes('int64').columns})

In [35]:
# Convert data type 
ords_prods = ords_prods.astype({'order_number':'int16', 'order_day_of_the_week':'int16', 'order_hour_of_day':'int16', 'days_since_last_order':'float16', 'department_id':'int16', 'prices':'float16','aisle_id':'int16', 'max_order':'int16','avg_order_price':'float32','median_of_regularity':'float16'})

In [36]:
# Check output
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int16
 3   order_day_of_the_week      int16
 4   order_hour_of_day          int16
 5   days_since_last_order      float16
 6   first_order                bool
 7   product_id                 int32
 8   add_to_cart_order          int32
 9   reordered                  int32
 10  _merge                     category
 11  product_name               object
 12  aisle_id                   int16
 13  department_id              int16
 14  prices                     float16
 15  match                      category
 16  price_range_loc            object
 17  busiest_day                object
 18  busiest days               object
 19  busiest_period_of_the_day  object
 20  max_order                  int16
 21  loyalty_flag               object
 22  avg_order_price            float32
 23  spending_flag              object
 24  median_of_regularity       float16
 25  order_frequency_flag       object
dtypes: bool(1), category(2), float16(3), float32(1), int16(6), int32(5), object(8)
memory usage: 3.5+ GB

**Observation:**<br/>
The memory usage of ords_prods dataframe has been successfully downsized from 5.9GB to 3.5GB.

In [37]:
# Check the shape of newly imported dataframe
ords_prods.shape

(32404859, 26)

In [38]:
# Check the shape of df_cus dataframe
df_cus.shape

(206209, 10)

In [39]:
# Identify key column in both dataframes
ords_prods.head(5)

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest days,busiest_period_of_the_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_of_regularity,order_frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Mid-range product,Least busy,Slowest days,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Mid-range product,Least busy,Slowest days,Most orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer

In [40]:
df_cus.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

**Observation:**
Column 'user_id' is identified as the key column for the merge.

In [41]:
# Check the data type of the key column in ords_prods dataframe
ords_prods['user_id'].dtype

dtype('int32')

In [42]:
# Check the data type of the key column in df_cus dataframe
df_cus['user_id'].dtype

dtype('O')

In [43]:
# Convert the data type of 'user_id' column in ords_prods dataframe
ords_prods['user_id'] = ords_prods['user_id'].astype ('str')

In [44]:
# Check result
ords_prods['user_id'].dtype

dtype('O')

**Observation:**<br/>
The data type of the key columns in both dataframes are unified.

### 6. Inner merge dataframes

In [45]:
# Drop the existing '_merge' column from previous exercises
ords_prods = ords_prods.drop(columns=['_merge'])

In [47]:
ords_prods_cus = ords_prods.merge(df_cus, on = 'user_id' , indicator = True)

In [48]:
# Check shape of newly merged dataframe
ords_prods_cus.shape

(32404859, 35)

In [52]:
pd.options.display.max_columns = None

In [53]:
# Check result
ords_prods_cus.head()

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_last_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,match,price_range_loc,busiest_day,busiest days,busiest_period_of_the_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_of_regularity,order_frequency_flag,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Most orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [54]:
# Drop match column from previous merge
ords_prods_cus = ords_prods_cus.drop('match', axis=1)

In [55]:
# Check inner join value counts
ords_prods_cus['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

**Observation:**<br/>
Two dataframes are successfully merged.

### 7. Export dataframe

In [56]:
# Export dataframe
ords_prods_cus.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))